app/Http/Controllers/ArticleController.php

select "id", "title", "subTitle", "slug", "status", "cover_image_path", "user_id", "created_at", "published_at", "created_at" from "articles" where ("title"::text LIKE '%Ratione soluta eaque perspiciatis fugit quia in.%' or "slug"::text LIKE '%Ratione soluta eaque perspiciatis fugit quia in.%') and "articles"."deleted_at" is null limit 10 offset 0
select "servers".*, "article_server"."article_id" as "pivot_article_id", "article_server"."server_id" as "pivot_server_id", "article_server"."created_at" as "pivot_created_at", "article_server"."updated_at" as "pivot_updated_at" from "servers" inner join "article_server" on "servers"."id" = "article_server"."server_id" where "article_server"."article_id" in ('13890569-149f-4113-ad2e-ce3a3a745326', '315d0539-c295-4e2e-ad22-206bbf2296e7', '346005f5-3e08-4db5-8ae5-01b432caf1bd', '480ab147-d056-454c-8d2f-df0768af8afa', '66332927-622a-4eac-8d8d-b4f574968844', '86dd78f0-c591-4dc2-88aa-6ef27cf02825', '98f034ab-d3bc-44f7-a85f-22967cf7ca61', 'd1d63bed-db14-40b7-9266-b9baf4a3442c', 'd32fc970-f592-446a-b50b-c1c0df436b48', 'f659a73a-c3dc-452b-b2b7-064746d7a633') and "servers"."deleted_at" is null
select count(*) as aggregate from "articles" where ("title"::text LIKE '%Ratione soluta eaque perspiciatis fugit quia in.%' or "slug"::text LIKE '%Ratione soluta eaque perspiciatis fugit quia in.%') and "articles"."deleted_at" is null
---
    public function index(Request $request): \Inertia\Response
    {

        $orderBy = $request->query('orderBy');

        $initialSearch = $request->query('search', '');

        $articlesQuery = Article::query()
            ->with('servers')
            ->select('id', 'title', 'subTitle', 'slug', 'status', 'cover_image_path', 'user_id', 'created_at', 'published_at', 'created_at')
            ->when($request->filled('search'), function ($query) use ($initialSearch) {
                $query->where('title', 'LIKE', '%' . $initialSearch . '%')
                    ->orWhere('slug', 'LIKE', '%' . $initialSearch . '%');
            })
            ->when($request->filled('orderBy'), function ($query) use ($orderBy) {
                $orderByKey = $orderBy['key'];
                $orderByDirection = $orderBy['direction'];
                $query->orderBy($orderByKey === 'author.name' ? 'user_id' : $orderByKey, $orderByDirection);
            });

        $articles = $articlesQuery
            ->paginate(10)
            ->onEachSide(2)
            ->appends(request()->only(['search']));

select * from "servers" where "servers"."deleted_at" is null
---
    public function edit(Article $article): \Inertia\Response
    {
        $servers = Server::all()->map(fn(Server $server) => $server->only(['id', 'name', 'logo_url', 'game']));