app/Http/Controllers/DashboardController.php

select count(*) as aggregate from "users" where "created_at" between '2021-02-12 18:06:19' and '2021-01-12 18:06:19' and "users"."deleted_at" is null
select * from "users" where "created_at" >= '2021-01-12 00:00:00' and "users"."deleted_at" is null
select "created_at" from "users" where "created_at" >= '2021-01-12 00:00:00' and "users"."deleted_at" is null order by "created_at" asc
---
   private function getUsersStats(): \stdClass
   {
       $newUsersToday = User::whereDay('created_at', Carbon::today())->count();
       $newUsersYesterday = User::whereDay('created_at', Carbon::yesterday())->count();

       $usersStats = new \stdClass();

       $usersStats->dailyDifferance = (int)round(Percentage::differenceBetween($newUsersYesterday, $newUsersToday), 2);

       $usersStats->isPositive = $usersStats->dailyDifferance > 0;

       $dailyUsers = User::select('created_at')->where('created_at','>=', Carbon::today()->subMonth())
           ->orderBy('created_at')
           ->get()
           ->groupBy(function ($val) {
               return Carbon::parse($val->created_at)->format('d');
           });