app/Http/Controllers/ServerController.php

select * from "servers" where "servers"."deleted_at" is null
select "id", "name", "logo_path", "ip", "port", "game_id", "created_at" from "servers" where "servers"."deleted_at" is null limit 10 offset 0
select "modpacks".*, "modpack_server"."server_id" as "pivot_server_id", "modpack_server"."modpack_id" as "pivot_modpack_id" from "modpacks" inner join "modpack_server" on "modpacks"."id" = "modpack_server"."modpack_id" where "modpack_server"."server_id" in ('4a6af8cf-2389-43e4-b73f-5f0c5c61c9bd', 'b85e517e-0cb1-4fa5-90d3-c00a8bc885a8', 'eed6bd50-9413-4220-ad4f-87491e280dbd')
select count(*) as aggregate from "servers" where "servers"."deleted_at" is null
---
    public function index(Request $request): Response|AnonymousResourceCollection|\Inertia\Response
    {
        $servers = Server::all();

        if ($request->wantsJson()) {
            return ServerResource::collection($servers);
        }

        $orderBy = $request->query('orderBy');

        $initialSearch = $request->query('search', '');

        $serversQuery = Server::query()
            ->with('modpacks')
            ->select('id', 'name', 'logo_path', 'ip', 'port', 'game_id', 'created_at')
            ->when($request->filled('search'), function ($query) use ($initialSearch) {
                $query->where('name', 'LIKE', '%' . $initialSearch . '%');
                $query->where('ip', 'LIKE', '%' . $initialSearch . '%');
            })
            ->when($request->filled('orderBy'), function ($query) use ($orderBy) {
                $orderByKey = $orderBy['key'];
                $orderByDirection = $orderBy['direction'];
                $query->orderBy($orderByKey, $orderByDirection);
            });

        $servers = $serversQuery
            ->paginate(10)
            ->onEachSide(2)
            ->appends(request()->only(['search']));

select * from "games"
select * from "modpacks"
---
    public function edit(Server $server): \Inertia\Response
    {
        $games = Game::all();

        $modPacks = Modpack::all();