app/Http/Controllers/UserController.php

    public function index(Request $request): \Inertia\Response
    {
        $orderBy = $request->query('orderBy');

        $initialSearch = $request->query('search', '');

        $userQuery = User::query()
            ->select('id', 'email', 'name', 'profile_photo_path', 'role', 'email_verified_at', 'created_at')
            ->when($request->filled('search'), function ($query) use ($initialSearch) {
                $query->where('name', 'LIKE', '%' . $initialSearch . '%')
                    ->orWhere('email', 'LIKE', '%' . $initialSearch . '%')
                    ->orWhere('role', 'LIKE', '%' . $initialSearch . '%');
            })
            ->when($request->filled('orderBy'), function ($query) use ($orderBy) {
                $orderByKey = $orderBy['key'];
                $orderByDirection = $orderBy['direction'];
                $query->orderBy($orderByKey === 'roleName' ? 'role' : $orderByKey, $orderByDirection);
            });

        $users = $userQuery
            ->paginate(10)
            ->onEachSide(2)
            ->appends(request()->only(['search']));
---
select "id", "email", "name", "profile_photo_path", "role", "email_verified_at", "created_at" from "users" where "users"."deleted_at" is null limit 10 offset 0
select count(*) as aggregate from "users" where "users"."deleted_at" is null